# Intro to Databases and SQL

![](images/sqlite.gif)


**GOALS**:

- Access and navigate SQL databases with Python
- Use basic SQL commands to query a database

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('data/example.db')
#using SQlite3 to connect to database
#by just calling a connection to another db you create the db but its EMPTY

In [4]:
c = conn.cursor()
#you can have more than one cursor at a time
#create cursor object

In [5]:
c.execute('''CREATE TABLE stocks
            (date text, trans text, symbol text, qty real, price real)''')

#creating a table with 5 features
#in SQL you specify the variable type upfont

In [6]:
# Insert a row of data
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

#INSERT INTO is a sql command
#entering a row of data

In [7]:
# Save (commit) the changes
# Once you've added it you can save this table with the commit command
# opening a connection to the db requires us to commit those changes and close that connection
conn.commit()

In [8]:
# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
conn.close()

### Problem

Create a table that contains the following information:

| Author | Title | Year | Price |
| -----  | ----- | ----- | ----- |
| Donald Knuth | Concrete Mathematics | 1989 | 5.00 |
| Isaac Newton | System of the World  |  1687 | 8.50 |
| Michel Foucault | Death and the Labyrinth | 1964 | 3.00 |

In [9]:
conn = sqlite3.connect('data/books.db')

In [10]:
c = conn.cursor()

In [15]:
c.execute('''CREATE TABLE libros
            (Author text, Title text, Year integer, Price real)''')

OperationalError: table libros already exists

In [12]:
c.execute("INSERT INTO libros VALUES ('Donald Knuth','Concrete Mathematics','1989', '5.00')")

In [13]:
c.execute("INSERT INTO libros VALUES ('Issac Newton','System of the World','1687', '8.50')")

In [14]:
c.execute("INSERT INTO libros VALUES ('Michael Foucault','Death and the Labyrinth','1964', '3.00')")

In [17]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")

In [18]:
print(c.fetchall())

[('libros',)]

In [19]:
c.close()
conn.close()

In [9]:
cur = conn.cursor()

In [10]:
books = '''
CREATE TABLE customers (
    id integer PRIMARY KEY,
    Author text NOT NULL,
    Title text NOT NULL,
    Year integer,
    Price real)'''

In [11]:
cur.execute(books)

In [12]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")

In [13]:
print(cur.fetchall())

[('customers',)]

In [14]:
cur.close()
conn.close()

# Work with survey database

In [20]:
conn = sqlite3.connect('data/survey.db')

In [21]:
cur = conn.cursor()
cur.execute("SELECT Site.lat, Site.long FROM Site;")

In [22]:
results = cur.fetchall()

In [23]:
for r in results:
    print(r)

(-49.85, -128.57)
(-47.15, -126.72)
(-48.87, -123.4)

In [24]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(cur.fetchall())

[('Person',), ('Site',), ('Visited',), ('Survey',)]

In [25]:
cur.close()
conn.close()

In [26]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()
cur.execute("SELECT family, personal FROM Person;")

In [27]:
cur.fetchall()

[('Dyer', 'William'),
 ('Pabodie', 'Frank'),
 ('Lake', 'Anderson'),
 ('Roerich', 'Valentina'),
 ('Danforth', 'Frank')]

In [28]:
cur.execute("SELECT  personal, family FROM Person;")
cur.fetchall()

[('William', 'Dyer'),
 ('Frank', 'Pabodie'),
 ('Anderson', 'Lake'),
 ('Valentina', 'Roerich'),
 ('Frank', 'Danforth')]

In [29]:
cur.execute("SELECT id, id, id FROM Person;")
cur.fetchall()

[('dyer', 'dyer', 'dyer'),
 ('pb', 'pb', 'pb'),
 ('lake', 'lake', 'lake'),
 ('roe', 'roe', 'roe'),
 ('danforth', 'danforth', 'danforth')]

In [30]:
cur.execute("SELECT  * FROM Person;")
results = cur.fetchall()
cur.close()
conn.close()

#* is a wildcard statement

In [32]:
import pandas as pd

conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()
df = pd.read_sql('SELECT * FROM person', con=conn)

In [33]:
df.head()

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [34]:
cur.close()
conn.close()

In [31]:
for r in results:
    print(r)

('dyer', 'William', 'Dyer')
('pb', 'Frank', 'Pabodie')
('lake', 'Anderson', 'Lake')
('roe', 'Valentina', 'Roerich')
('danforth', 'Frank', 'Danforth')

### Problem

1. Write a query that select only the `name` column from the `Site` table.

In [35]:
conn = sqlite3.connect('data/survey.db')

df2 = pd.read_sql('SELECT name FROM Site', con=conn)

In [36]:
df2.head()

    name
0   DR-1
1   DR-3
2  MSK-4

In [37]:
conn.close()

### Sort and Remove Duplicates

In [38]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [39]:
cur.execute("SELECT quant FROM Survey;")

In [40]:
cur.fetchall()

[('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('sal',),
 ('rad',)]

In [41]:
cur.execute("SELECT DISTINCT quant FROM Survey;")

#add DISTINCT to command to get unique values

In [42]:
cur.fetchall()

[('rad',), ('sal',), ('temp',)]

In [43]:
cur.execute("SELECT DISTINCT taken, quant FROM Survey;")
cur.fetchall()

#we get back the unique 'takens' with the quant

[(619, 'rad'),
 (619, 'sal'),
 (622, 'rad'),
 (622, 'sal'),
 (734, 'rad'),
 (734, 'sal'),
 (734, 'temp'),
 (735, 'rad'),
 (735, 'sal'),
 (735, 'temp'),
 (751, 'rad'),
 (751, 'temp'),
 (751, 'sal'),
 (752, 'rad'),
 (752, 'sal'),
 (752, 'temp'),
 (837, 'rad'),
 (837, 'sal'),
 (844, 'rad')]

In [44]:
cur.execute("SELECT * FROM Person ORDER BY id;")
cur.fetchall()

#we can add the ORDER BY command at the end of a query

[('danforth', 'Frank', 'Danforth'),
 ('dyer', 'William', 'Dyer'),
 ('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('roe', 'Valentina', 'Roerich')]

In [45]:
cur.execute("SELECT * FROM Person ORDER BY id DESC;")
cur.fetchall()

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

In [46]:
cur.execute("SELECT taken, person, quant FROM Survey ORDER BY taken ASC, person DESC;")
cur.fetchall()

#can ORDER BY multiple criteria
#selecting 3 quantities from this table Survey
#taken values will be Ascending
#but Person values will be descending

[(619, 'dyer', 'rad'),
 (619, 'dyer', 'sal'),
 (622, 'dyer', 'rad'),
 (622, 'dyer', 'sal'),
 (734, 'pb', 'rad'),
 (734, 'pb', 'temp'),
 (734, 'lake', 'sal'),
 (735, 'pb', 'rad'),
 (735, None, 'sal'),
 (735, None, 'temp'),
 (751, 'pb', 'rad'),
 (751, 'pb', 'temp'),
 (751, 'lake', 'sal'),
 (752, 'roe', 'sal'),
 (752, 'lake', 'rad'),
 (752, 'lake', 'sal'),
 (752, 'lake', 'temp'),
 (837, 'roe', 'sal'),
 (837, 'lake', 'rad'),
 (837, 'lake', 'sal'),
 (844, 'roe', 'rad')]

In [47]:
cur.execute("SELECT taken, person, quant FROM Survey ORDER BY taken ASC, person DESC limit 2;")
cur.fetchall()

#limit # command

[(619, 'dyer', 'rad'), (619, 'dyer', 'sal')]

In [49]:
conn.close()

1. Write a query that selects distinct dates from the `Visited` table.
2. Write a query that displays the full names of the scientists in the `Person` table, ordered by family name.

In [50]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [58]:
cur.execute("SELECT * FROM Visited;")

In [59]:
cur.fetchall()

[('619', 'DR-1', '1927-02-08'),
 ('622', 'DR-1', '1927-02-10'),
 ('734', 'DR-3', '1930-01-07'),
 ('735', 'DR-3', '1930-01-12'),
 ('751', 'DR-3', '1930-02-26'),
 ('752', 'DR-3', None),
 ('837', 'MSK-4', '1932-01-14'),
 ('844', 'DR-1', '1932-03-22')]

In [60]:
df3 = pd.read_sql('SELECT * FROM Visited', con=conn)
df3.head()

    id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10
2  734  DR-3  1930-01-07
3  735  DR-3  1930-01-12
4  751  DR-3  1930-02-26

In [61]:
cur.execute("SELECT dated FROM Visited;")

In [64]:
cur.execute("SELECT DISTINCT dated FROM Visited;")
cur.fetchall()

[('1927-02-08',),
 ('1927-02-10',),
 ('1930-01-07',),
 ('1930-01-12',),
 ('1930-02-26',),
 (None,),
 ('1932-01-14',),
 ('1932-03-22',)]

In [66]:
cur.execute("SELECT * FROM Person;")
cur.fetchall()

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

In [70]:
cur.execute("SELECT family, personal FROM Person ORDER BY family;")

In [71]:
pd.read_sql("SELECT family, personal FROM Person ORDER BY family",con=conn)

     family   personal
0  Danforth      Frank
1      Dyer    William
2      Lake   Anderson
3   Pabodie      Frank
4   Roerich  Valentina

In [72]:
pd.read_sql("SELECT family, personal FROM Person ORDER BY family",con=conn).columns

Index(['family', 'personal'], dtype='object')

In [73]:
conn.close()

### Filtering

In [75]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

cur.execute("SELECT * FROM Visited WHERE site='DR-1';")
cur.fetchall()

[('619', 'DR-1', '1927-02-08'),
 ('622', 'DR-1', '1927-02-10'),
 ('844', 'DR-1', '1932-03-22')]

In [41]:
cur.execute("SELECT * FROM Visited WHERE site='DR-1' AND dated<'1930-01-01';")
cur.fetchall()

#use WHERE command to filter within sql statements

[('619', 'DR-1', '1927-02-08'), ('622', 'DR-1', '1927-02-10')]

In [42]:
cur.execute("SELECT * FROM Survey WHERE person='lake' OR person='roe';")
cur.fetchall()

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [43]:
cur.execute("SELECT * FROM Survey WHERE person IN ('lake', 'roe');")
cur.fetchall()

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [44]:
cur.execute("SELECT * FROM Visited WHERE site LIKE 'DR%';")
cur.fetchall()

#% sign acts a wildcard

[('619', 'DR-1', '1927-02-08'),
 ('622', 'DR-1', '1927-02-10'),
 ('734', 'DR-3', '1930-01-07'),
 ('735', 'DR-3', '1930-01-12'),
 ('751', 'DR-3', '1930-02-26'),
 ('752', 'DR-3', None),
 ('844', 'DR-1', '1932-03-22')]

1. Suppose we want to select all sites that lie more than 42 degrees from the poles. Our first query is:
```sql
SELECT * FROM Site WHERE (lat > -48) OR (lat < 48);
```
Explain why this is wrong, and rewrite the query so that it is correct.

2. 
Normalized salinity readings are supposed to be between 0.0 and 1.0. Write a query that selects all records from Survey with salinity values outside this range.

In [76]:
cur.execute('SELECT * FROM Site WHERE (lat > -48) OR (lat < 48);')

In [77]:
cur.fetchall()

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [78]:
cur.execute('SELECT * FROM Site WHERE (lat < -42) OR (lat > 42);')

In [79]:
cur.fetchall()

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [84]:
cur.execute('SELECT * FROM Survey;')
cur.fetchall()

[(619, 'dyer', 'rad', 9.82),
 (619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'rad', 7.8),
 (622, 'dyer', 'sal', 0.09),
 (734, 'pb', 'rad', 8.41),
 (734, 'lake', 'sal', 0.05),
 (734, 'pb', 'temp', -21.5),
 (735, 'pb', 'rad', 7.22),
 (735, None, 'sal', 0.06),
 (735, None, 'temp', -26.0),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [88]:
cur.execute('SELECT * FROM Survey WHERE (reading < 0) OR (reading > 1);')

In [89]:
cur.fetchall()

[(619, 'dyer', 'rad', 9.82),
 (622, 'dyer', 'rad', 7.8),
 (734, 'pb', 'rad', 8.41),
 (734, 'pb', 'temp', -21.5),
 (735, 'pb', 'rad', 7.22),
 (735, None, 'temp', -26.0),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [45]:
cur.close()
conn.close()

![](images/exploits_of_a_mom.png)

In [27]:
# Never do this -- insecure!
symbol = 'RHAT'
conn = sqlite3.connect('data/example.db')
c = conn.cursor()
c.execute("SELECT * FROM stocks WHERE symbol = '%s'" % symbol)

In [28]:
conn.close()

In [29]:
conn = sqlite3.connect('data/example.db')
c = conn.cursor()
# Larger example that inserts many records at a time
purchases = [('2006-03-28', 'BUY', 'IBM', 1000, 45.00),
             ('2006-04-05', 'BUY', 'MSFT', 1000, 72.00),
             ('2006-04-06', 'SELL', 'IBM', 500, 53.00),
            ]
c.executemany('INSERT INTO stocks VALUES (?,?,?,?,?)', purchases)

In [30]:
conn.close()